# Shell and CLI
brew "zsh"
brew "git"
brew "git-lfs"
brew "gh"
brew "fnm"
brew "pnpm"
brew "uv"
brew "tree"
brew "starship"
brew "ripgrep"
brew "fzf"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "jq"
brew "git-delta"
brew "lazygit"

# Apps
cask "visual-studio-code"
cask "google-chrome"
cask "spotify"
cask "slack"
cask "iterm2"
cask "droplr"
cask "obsidian"
cask "rectangle"
cask "github"
cask "betterdisplay"
cask "figma"
cask "claude-code"
cask "claude"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
